# CanResetCameraTarget Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..CanResetCameraTarget Method
View3D Class See Also
---
Checks whether the camera target can be reset for this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public bool CanResetCameraTarget()
```

Visual Basic
---
```text
Public Function CanResetCameraTarget As Boolean
```

Visual C++
---
```text
public:
bool CanResetCameraTarget()
```

# ### Return Value
True if camera target can be reset for this view, false otherwise.
# Remarks
The camera target can only be reset for perspective view.
# See Also
View3D Class
Autodesk.Revit.DB Namespace